{"Review": "Nice movie and Nicholle Tom does a fantastic job playing the \"guy in the girl's body\", she really does it well.<br /><br />A sort of teen version of many other movies, but well done.<br /><br />Well casted, from \"Matt\" to \"Matt2\".", "label": 0, "predicted": 1}
 {"Review": "A young doctor and his wife are suddenly expecting a child. Both are disturbed about a two hour memory lapse on the night of conception. Interesting twist on an hackneyed story. Very good F/X and interesting editing. Jillian McWhirter is outstanding in a cast that features Arnold Vosloo, Wilford Brimley and Brad Dourif. Brimley brings normalcy to the outlandish. Kudos to director Brian Yuzna.", "label": 0, "predicted": 1}
  {"Review": "Although I had previously watched this one some time ago on Italian TV, I found it to be a surprisingly tolerable potboiler this time round, buoyed by an international cast of familiar faces (including a bemused Joseph Cotten as the Baron) and, contrary to many another film of the Euro-Cult sub-genre, an incident-packed plot in place of lethargic pacing.<br /><br />The creature itself looks a bit dodgy and Cotten is a bit too old to be taken seriously as an eager scientist still dabbling in creating life-forms out of corpses (one would have thought that he would have made himself an army of them by now and not struggling at perfecting his technique still) but Ms. Neri does look good in and out of costume and reliable Herbert Fux probably comes off best as a lecherous grave-robber/blackmailer.", "label": 0, "predicted": 1}
   {"Review": "You think the police are always right.<br /><br />You believe that \"eye-witnesses\" are always right.<br /><br />You believe the prosecutors will not take a case to court if lazy police have failed to perform 98% of a basic investigation.<br /><br />You believe a U.S. city might have a \"few bad apples\" in law enforcement, but that the \"good cops\" will quickly nip those who systematically engage in evil-for-evil's sake in the bud.<br /><br />You believe that the possibility of an ex-football lineman being instated as a detective solely because his dad is the county sheriff, and being allowed to beat \"confessions\" out of randomly-selected teenagers with absolutely no fear of negative consequences to himself could happen in the America of the 1930s, but not today.<br /><br />You believe a judge will NOT send a case to the jury if anyone with a brain in their head can see the defendant is a totally random passer-by nabbed by the police because it was hot, and they did not feel like working that day.<br /><br />You believe that all the innocent people imprisoned six months here or 20 years there are \"exceptions to the rule,\" and an injustice like this could NEVER involve your family member, someone in the middle class, or someone like YOU.<br /><br />You think that you are aware of every terrible, indisputable, 100% proved outrage of the last 10 years in America--yet you haven't seen this film.", "label": 1, "predicted": 0}
    {"Review": "Actually I'll admit I'm a political junkie, so this resonated with me, but the erratic nature of Ms. Green (yes I know what they did to her), but the ending was such a copout and totally inconsistent with the film itself.<br /><br />Why can't Barry L and crew just left us wondering what he was going to do? Let us debate it.<br /><br />Instead they have this \"oh I'm not worthy\" bullshit ending and it just shows that when the chips were down it's better to leave the table instead of doubling down. Stop the Disney ending and putting a bow on it. Life isn't easy, they should have had the courage to give the main character some backbone.<br /><br />We had to listen to the rhetoric the entire movie... and then it turned sniveling and the stupid, inane behavior by Ms. Green (when the crap was out of her system) just made for a ridiculous near end of the movie that was icing on the cake.", "label": 1, "predicted": 0}
     {"Review": "THE FEELING of the need to have someone play the role of Arbiter of Public Taste and Political Correctness always manages to get under our skin. It does seem that these self-appointed, self-superior, pseudo-intellectual types do appear everywhere; be it in one's family, church or bowling league.<br /><br />THESE are the guys who would have society completely disregard and ignore all that went before us; unless, of course, whatever 'it' is does not fly in the face of today's \"acceptable\" language, mores and general \"standards\" of \"proper\" behavior.<br /><br />SO it is that these latter day, high tech book burners have targeted a great deal of what was Hollywood's greatest achievement; namely their participation in our own Allied Propaganda via their unselfishly crafted message and theme films.<br /><br />COLDLY brutal in its generation, the Banned Code and List of Now Unacceptable extends into the Wartime Cartoons that don't meet with the new touchy, feely socially engineered 'official' attitudes; which these \"Thought Police\" have foisted down upon us.<br /><br />WE were truly surprised to see that there seem to be volumes of such animated short subjects. The majority we are aware of are from Warner Brothers' LOONEY TUNES and MERRIE MELODIES; featuring Bugs, Daffy, Elmer & Porky, all in conflict with Hitler, Goerring, 'Il Duce', Tojo and the like. Surprisingly though, we found an ample supply of cartoons from MGM, Walt Disney, Lantz, Paramount-Famous Studios and the Brothers Fleischer.<br /><br />YOU'RE A SAP MR. JAP (Famous Studios/Paramount Pictures, 1942) is a prime example of just what we're talking about.<br /><br />BEING virtually indiscernible from the cartoons that were the output of the Studios of Max and Dave Fleischer before the 1941 business coup-de-tat that moved them out, bringing the new name of \"Famous\" Studios, YOU'RE A SAP MR. JAP bore none of the bland plot elements that would reduce the latter day Popeye Cartoons down to the level of the ultimate formula short movie.<br /><br />WE all remember how we'd have Popeye and Olive Oyl together. Enter Bluto, usually the exponent of wolf whistle and an on acceptable on-screen version of a Male reaction to feminine pulchritude. Olive falls for Bluto's less than honorable attentions; until he gets a little too physical and invariably blurts out, \"Hey Babe, how 'bout a kiss?\" At this point we hear \"Help! Help, Popeye and the diminutive sailor shows up to save the day; replete with the obligatory can of Spinach! DO we exaggerate, Schultz? ONCE again this JAP SAP cartoon is nothing like any of that. Oh sure, it follows the storyline of now having Popeye in the U.S. Navy. The Brothers Fleischer put the little guy in the service in 1941 to conform to the mood in the country and as an open gesture of support for the men now being conscripted in the first Peacetime Draft in United States History. Max and Dave even put Popeye in service aboard the mythical Battleship, the U.S.S. Pensyltucky.<br /><br />OUR point is just this. YOU'RE A SAP MR. JAP and others like SPINACH FER Britain aren't cartoon vehicles for comic relief in the Theatre's program at all in the true sense. Rather they are a sort of grouping of Editorial Cartoons much like those from any \"Great Metropolitan Newspaper\". These animated shorts, much like those still one panel illustrations, have characters that are highly symbolic and representative of Nations, Ideas and Ideals, such as a just and lasting Peace. In most cases, the hero (Popeye, Bugs Bunny or whoever) is alone with the symbol of the Enemy. Both are highly exaggerated visual metaphors for abstract concept and thought; even if they are cloaked in humorous trappings for wider palatability.<br /><br />OUR liberal stupidgencia (the antithesis of intelligencia) may not see themselves this way; but for this sort of behavior, they are no more than Neo Nazi Book burners.<br /><br />PLEASE, allow the future generations to view and appreciate a view of past happenings that is both Historical and Humorous.<br /><br />POODLE SCHNITZ!!", "label": 1, "predicted": 0}
      {"Review": "I saw this movie in 1956 and again on Cable a few days ago. The movie hasn't improved with age. Quite the opposite. It's a true spaghetti epic.<br /><br />The Trojans are heroic and likable; the Greeks are nasty, petty and sneaky.<br /><br />So what if Paris ran off with the King's wife? Hey...love is love.", "label": 0, "predicted": 1}
       {"Review": "Without a doubt, this is the big momma of all music videos!!! Unlike most music videos that are either \"dance videos\" badly storied and/or badly interrupted lyrics this was done right. Jackson was co-writer and by evidence of VH1 heavily choreographed and directed this masterpiece. In fact you could say Thriller is creepier then most horror movies with that last second sparkling eye. To me this music video is what you judge all other music videos on. You can easily see the ominous influence M.J. had on early break-dancing with the zombie march number. Because of the dancing, comedy, storyline, and yes horror. I give it a 5 of 5.", "label": 1, "predicted": 0}
        {"Review": "An intelligent summation of Cold War era mutually assured destruction policy, up until the conclusion: it's a gasser! All Russians and Chinese are obliterated from the face of the Earth! Saw this one at the 27th Annual CWRU Science Fiction Marathon, January 2002.", "label": 0, "predicted": 1}
         {"Review": "I'm sort of between the gushy review and the hate review. I've been a fan of Lovecraft (and a Lovecraft 'purist') for a long time, and while this little amateur film was of poor quality it had a number of redeeming qualities. I went into viewing expecting the worst thing I've ever seen, and wondering if Lovecraft would turn in his grave over it, but I was shocked to find that I actually kind of liked it.<br /><br />I don't want to catalog the movie's faults, so I'll only mention a few that keep this movie from being a 'stellar amateur effort'.<br /><br />It's very low budget and shot on a video cam, so it has the look of some soap operas, but once you get used to the idea then it ceases to be a big deal. The direction is pretty amateur and the shot framing and use of distance in the shots is rather clumsy. STILL, this film was actually kind of creepy and it stayed more faithful to Lovecraftian intent than nearly all the Stuart Gordan and Brian Yuzna travesties (my main exception to those films being Re-Animator and Dagon) put together. The idea of being impregnated by some Old One is reminiscent of Dunwich Horror and Shadow over Innsmouth (which isn't to say this movie is as good as those stories!!), so the overall plot is quite faithful to Lovecraft's ideas. One thing that annoyed me was that words out of the bible seemed to make a zombie prisoner upset and afraid. I'm not sure if this was meant to indicate that 'God's' words upset the Old Ones or just this particular zombie. There was no real answer to that. The rest of the Christian symbolism in it reminds me of August Derleth's take on the mythos. So in a way this was a Derleth style take on the mythos.<br /><br />I would recommend this film only as a curiosity. It shows how a fairly atmospheric movie can be made with nearly zero budget. I liked the setting of the wine cellars. The outdoor shots were sad, though. Using the same stretch of beach and trees (and nearly the same damn shot) to convey 3 characters' long journey was really sad. The director needs whack upside the head for that. The acting was standard for an amateur film, with the blonde zombie girl getting a personal award for \"Best Impersonation of Gollum by an Italian Actress\". Actually I think this film was done prior to the Lord of the Rings movies. Maybe Andy Sedaris watched her and thought \"Dang, she'd make a great Gollum!\" <br /><br />One little kudo to the director, though. The makeup on the zombies was like bad goth kids. I was upset seeing this and nearly stopped watching. I was like \"Oh so that's how we know she's evil and possessed\", but later on in the movie you see a girl painting makeup like that on the face of an older woman (both living). So it wasn't an attempt to say 'goth makeup = zombie' but rather, 'goth makeup was left on after zombification'. However, possessed/zombie does equal 'blue contact lenses'...heh.<br /><br />On the whole, I still liked this movie better than the Yuzna and Gordan films (barring the aforementioned exceptions). Yuzna and Gordan had much better budgets, but this film did a better job at filming a Lovecraft-like story than they did, and on a tiny budget.<br /><br />One quick word to the the make-up artist: I know you wanted 'claws' or something on Zariah's fingers, but long, black press-on nails looked really silly.<br /><br />A quick word to the writer of the score: I know you couldn't resist, and apparently neither could the director who okayed it, but when the two characters square off with guns for a 'duel', playing that little whistle from \"The Good, the bad, and the ugly\" killed any mood that scene had accumulated. It was cute, but cute wasn't appropriate.<br /><br />The filmmakers of this movie have read Lovecraft and had a great deal of respect for him. I enjoyed the little nods here and there: the character Carter with the bad dreams, and the character Pickman who becomes a ghoulish zombie.", "label": 0, "predicted": 1}